app/controllers/signups_controller.rb

  def create
  	@signup = Signup.new(signup_params)
  	if @signup.save
---
INSERT INTO "signups" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "me@me.com"], ["created_at", "2016-04-19 23:50:07.475318"], ["updated_at", "2016-04-19 23:50:07.475318"]]